Repository: daniilshipilin/SplashImageViewer
Catalog: SplashImageViewer/Properties/Strings.*.resx
Languages: ru

source: About
ru: Информация

# AboutToolStripMenuItem
source: &About
ru: &Информация

# AppDescription
source: A simple image viewer with slideshow feature.
ru: Программа-просмотрщик изображений с функцией слайд-шоу.

source: Author
ru: Автор

source: Available
ru: Доступна

# Byte
source: byte(s)
ru: байт(ов)

source: Changing UI language requires app restart.
ru: Для изменения языка пользовательского интерфейса требуется перезапуск приложения.

# CheckForAvailableUpdates
source: Need to check for available updates
ru: Необходима проверка на наличие обновлений

# CheckingForUpdates
source: Checking for available updates
ru: Производится проверка на наличие обновлений

# CheckScreenDimensionsWarning
source: The minimum screen resolution requirements not met
ru: Не соблюдены минимальные требования к разрешению экрана

# CheckUpdatesButtonToolTip
source: Check for available updates
ru: Проверить наличие доступных обновлений

# CloseImageMenuItem
source: &Close Image
ru: &Закрыть Файл

source: Current
ru: Текущая

source: Default settings
ru: Настройки по умолчанию

# DeleteButtonToolTip
source: Delete a file currently open [DEL]
ru: Удалить текущее изображение [DEL]

source: Delete file
ru: Удаление файла

source: Description
ru: Описание

source: Dimensions
ru: Размер изображения

# ExitMenuItem
source: &Exit
ru: &Выйти

source: File delete confirmation required
ru: Требуется подтверждение для удаления файла

# FileDeletePrompt
source: Are you sure you want to delete this file?
ru: Вы уверены, что хотите удалить этот файл?

source: File size
ru: Размер файла

# FileToolStripMenuItem
source: &File
ru: &Файл

source: Force check updates
ru: Принудительная проверка на наличие обновлений

# ForceProgramUpdatePrompt
source: Force program update?
ru: Принудительно обновить программу?

# ForceProgramUpdateToolTip
source: Press, to force program update
ru: Нажмите, чтобы принудительно обновить программу

# FullscreenButtonToolTip
source: Fullscreen mode [F]
ru: Полноэкранный режим [F]

# GeneralException
source: Exception encountered
ru: Произошла системная ошибка

# GeneralWarning
source: Warning
ru: Предупреждение

source: GUID was not found
ru: GUID не найден

# HashSumMismatch
source: Downloaded package hash sum mismatch
ru: Обнаружено несоответствие хеш-суммы

source: Image modified
ru: Изображение изменено

# ImageModifiedCaps
source: IMAGE MODIFIED
ru: ИЗОБРАЖЕНИЕ ИЗМЕНЕНО

source: Kbyte
ru: Кбайт

source: Last check
ru: Последняя проверка

source: Mbyte
ru: Мбайт

source: Memory allocated
ru: Памяти используется

source: Method needs to be called first
ru: Сначала нужно вызвать этот метод

source: Modified file overwrite confirmation required
ru: Требуется подтверждение перезаписи измененного файла

source: Newer program version available
ru: Доступна более новая версия программы

# NextButtonToolTip
source: Next image [RIGHT/UP ARROW]
ru: Следующие изображение [СТРЕЛКА ВПРАВО/ВВЕРХ]

# OpenFolderMenuItem
source: Open &Folder
ru: Открыть &Папку

# OpenImageMenuItem
source: &Open Image
ru: &Открыть Изображение

# OpenSettingsButtonToolTip
source: Open settings [S]
ru: Открыть настройки программы [S]

# OverwriteImagePrompt
source: Overwrite current image?
ru: Перезаписать текущее изображение?

# PreviousButtonToolTip
source: Previous image [LEFT/DOWN ARROW]
ru: Предыдущие изображение [СТРЕЛКА ВЛЕВО/ВНИЗ]

# ProgramIsUpToDate
source: Current program version is up to date
ru: Текущая версия программы актуальна

source: Program update
ru: Обновление программы

# RandomButtonToolTip
source: Select random image [R]
ru: Выбрать изображение в случайном порядке [R]

source: Randomize slideshow order
ru: Произвольный порядок изображений слайд-шоу

# RecentItemsMenuItem
source: &Recent Items
ru: Последние &Файлы

source: Reset
ru: Сброс

# ResetSettingsPrompt
source: Reset settings?
ru: Сбросить настройки?

# RotateImageButtonToolTip
source: Rotate image [D]
ru: Повернуть изображение на 90 градусов [D]

source: Search images in subdirectories
ru: Искать изображения в подкаталогах (рекурсивно)

source: seconds remaining
ru: секунд осталось

source: Settings
ru: Настройки

# SettingsCommitToolTip
source: Commit changes
ru: Сохранить изменения

# SettingsToolStripMenuItem
source: &Settings
ru: &Настройки

# SlideshowButtonToolTip
source: Start/stop slideshow [SPACE]
ru: Запустить/остановить слайдшоу [ПРОБЕЛ]

source: SLIDESHOW ENABLED
ru: СЛАЙДШОУ АКТИВЕН

# SlideshowInfoLabel
source: Press [F] or [ESC] to exit fullscreen mode
ru: Нажмите клавишу [F] или [ESC] чтобы выйти из полноэкранного режима

source: Slideshow mode is active
ru: Режим слайд-шоу активен

# SlideshowTransition
source: Slideshow transition (s):
ru: Переход между слайдами (сек.):

# SourceCodeRepoToolTip
source: Visit project source code repository on github.com
ru: Посетите репозиторий исходного кода проекта на github.com

# StopSlideshowFirstPrompt
source: Please stop slideshow first.
ru: Пожалуйста, сначала остановите слайд-шоу.

source: Theme color:
ru: Цвет темы:

source: Type
ru: Тип

source: UI language:
ru: Язык интерфейса:

source: UI language changed
ru: Язык интерфейса изменён

source: Update in progress
ru: Производится обновление программы

# UpdateProgramPrompt
source: Update program?
ru: Обновить программу?

# ZoomButtonToolTip
source: Zoom in/out image [Z]
ru: Приблизить/отдалить изображение [Z]
